{
  "plant": {
    "common_name": "Milkweed",
    "scientific_name": "Asclepias spp.",
    "family": "Apocynaceae",
    "description": "Brief Description: The sources do not provide a detailed physical description, habitat, or common locations for Milkweed. The limited information available notes that it is an outdoor plant that contains a toxic sap1. The sources also highlight its unique ecological role: the monarch butterfly ingests milkweed and stores the plant's toxic cardiac glycosides in its wings as a defense mechanism to protect itself from predators"
  },
  "basics": {
    "family": "Apocynaceae",
    "description": "Brief Description: The sources do not provide a detailed physical description, habitat, or common locations for Milkweed. The limited information available notes that it is an outdoor plant that contains a toxic sap1. The sources also highlight its unique ecological role: the monarch butterfly ingests milkweed and stores the plant's toxic cardiac glycosides in its wings as a defense mechanism to protect itself from predators"
  },
  "toxic_parts": [
    "Entire Plant",
    "Sap"
  ],
  "toxins": [
    {
      "name": "Cardiac glycosides",
      "chemical_formula": null,
      "description": "in cats: These toxins directly target the cardiovascular system by inhibiting the Na\n+\n/K\n+\n-ATPase pump3. This inhibition causes an accumulation of intracellular sodium and extracellular potassium, which subsequently triggers a rise in intracellular calcium3. This cellular disruption forces the cardiac muscle to contract more forcefully but at a slower rate, resulting in severe abnormal heart rates and rhythms34. Ingestion can also trigger a cascade of other severe issues, including vomiting, diarrhea, generalized weakness, breathing difficulties, neurological signs, and potential damage to the liver or kidneys",
      "concentration_notes": "The overall toxicity of Milkweed ranges from moderate to severe depending on the amount the cat ingests4. Plants containing cardiac glycosides are considered to be among the most toxic plants and have a very \"narrow margin of safety\"1. All parts of the milkweed plant, including its sap, are considered toxic"
    }
  ],
  "symptoms": [
    {
      "name": "Vomiting and diarrhea",
      "body_system": "Gastrointestinal",
      "severity": "severe",
      "onset": "Within 2 hours",
      "notes": "These are generally the first visible signs of cardiac glycoside toxicosis before systemic cardiovascular symptoms become apparent12.\n2. Cardiovascular Abnormalities"
    },
    {
      "name": "Abnormal heart rates and rhythms (including bradycardia, tachycardia, and severe arrhythmias)",
      "body_system": "Cardiac",
      "severity": "fatal",
      "onset": "Within 2 hours",
      "notes": "This is the most dangerous effect of the plant's cardiac glycosides, which disrupt the Na+/K+ ATPase pump and alter how the heart muscle contracts. This can also trigger hyperkalemia (dangerously high potassium levels in the blood), which is life-threatening12.\n3. Generalized Weakness and Neurological Signs"
    },
    {
      "name": "Weakness and unspecified neurological signs",
      "body_system": "Neurological",
      "severity": "severe",
      "onset": "Within 2 hours",
      "notes": "These symptoms manifest as the cardiovascular system becomes profoundly depressed and cellular oxygen/energy cycles are disrupted12.\n4. Breathing Difficulties"
    },
    {
      "name": "Breathing difficulties (dyspnea)",
      "body_system": "Respiratory",
      "severity": "severe",
      "onset": "Within 2 hours (or developing as the condition worsens).",
      "notes": "Respiratory distress frequently occurs secondarily as the heart begins to fail and blood pressure drops2.\n5. Organ Damage"
    },
    {
      "name": "Organ damage",
      "body_system": "Renal",
      "severity": "severe",
      "onset": "Delayed (typically develops as symptoms persist over 4–5 days).",
      "notes": "Depending heavily on the amount of milkweed or toxic sap ingested, systemic toxicity can ultimately cause severe damage to the liver or kidneys"
    }
  ],
  "treatments": [
    {
      "name": "Emesis Induction and Activated Charcoal",
      "description": "If the cat is currently asymptomatic, the veterinarian will induce vomiting (emesis) to quickly remove the plant material from the stomach. Following this, they will administer a dose of activated charcoal with a cathartic to bind to and prevent the absorption of any remaining toxins",
      "notes": "Because cardiac glycosides undergo \"enterohepatic recirculation\" (recirculating continuously through the liver and intestines), it is recommended to repeat the administration of activated charcoal (without a cathartic) every 6 to 8 hours for a total of 3 doses2.\n2. Antidote Administration",
      "priority": 1
    },
    {
      "name": "Digoxin-specific antibody fragments (Fab)",
      "description": "The veterinarian administers this specific antidote. While primarily designed for digoxin toxicity, these antibody fragments cross-react and work effectively against plant-based cardiac glycosides",
      "notes": "If this specialized antidote is unavailable at the clinic, the veterinarian will have to rely heavily on the pharmacological cardiac controls listed below2.\n3. Pharmacological Cardiac Control",
      "priority": 2
    },
    {
      "name": "Antiarrhythmic and Heart Rate Medications (Atropine, Glycopyrrolate, Lidocaine)",
      "description": "The vet will administer specific medications to correct the heart's electrical abnormalities. Atropine and glycopyrrolate have been used successfully to correct severe bradycardia (slow heart rate), while antiarrhythmics like lidocaine are used to manage other heart rhythm defects",
      "notes": "This treatment is primarily utilized to manage cardiovascular symptoms when access to the Digoxin-specific antidote is not available2.\n4. Fluid Therapy and Electrolyte Management",
      "priority": 3
    },
    {
      "name": "Intravenous (IV) Fluid Therapy and Hyperkalemia Management",
      "description": "The cat is given IV fluids to provide necessary hemodynamic support, while the vet closely monitors their electrolyte levels to watch for hyperkalemia (dangerously high potassium in the blood)",
      "notes": "Mild hyperkalemia can often be treated with IV fluids alone. However, if the hyperkalemia becomes severe (measuring greater than 7.5–9 mEq/L), the vet will need to treat it aggressively using sodium bicarbonate or a dextrose and insulin treatment",
      "priority": 4
    }
  ]
}