{
  "plant": {
    "common_name": "Fiddle Leaf Fig",
    "scientific_name": "Ficus lyrata",
    "family": "Moraceae",
    "description": "Brief Description\n• Appearance: Ficus species are described as trees, shrubs, or vines. A key characteristic of the genus, including the Fiddle Leaf Fig, is the presence of milky sap found in the leaves and stems.12\n• Where Commonly Found: It is widely cultivated as a potted plant or used in indoor landscaping as a houseplant.13"
  },
  "basics": {
    "family": "Moraceae",
    "description": "Brief Description\n• Appearance: Ficus species are described as trees, shrubs, or vines. A key characteristic of the genus, including the Fiddle Leaf Fig, is the presence of milky sap found in the leaves and stems.12\n• Where Commonly Found: It is widely cultivated as a potted plant or used in indoor landscaping as a houseplant.13"
  },
  "toxic_parts": [
    "Leaf",
    "Sap",
    "Stem"
  ],
  "toxins": [
    {
      "name": "Insoluble Calcium Oxalate crystals (often referred to as raphides)",
      "chemical_formula": "Not explicitly provided in the sources.",
      "description": "in cats:\n    ◦ Physical Trauma and Irritation: These crystals are needle-like structures bundled in specialized plant cells. When a cat chews or crushes the plant tissue, these sharp crystals are forcefully shot out into the lining of the mouth, tongue, and throat. This causes immediate, intense pain and physical trauma to the tissues, leading to inflammation and swelling.\n    ◦ Clinical Signs: The immediate pain typically causes the cat to stop eating quickly, but symptoms include excessive drooling, pawing at the mouth, oral swelling, and vomiting.\n4. Notes on",
      "concentration_notes": "◦ These crystals are found within the irritant sap present in the leaves and stems of the plant.\n    ◦ The toxicity is generally considered mild, primarily resulting in local irritation rather than systemic organ damage."
    },
    {
      "name": "Proteolytic Enzymes (specifically Ficin) and Psoralens (also known as Furocoumarins)",
      "chemical_formula": "Not explicitly provided in the sources.",
      "description": "in cats:\n    ◦ Dermatitis and GI Irritation: These compounds are characteristic of the Ficus genus. They are found in the milky sap and can cause contact dermatitis (skin irritation, redness, and blisters) if the sap touches the cat's skin. Upon ingestion, they contribute to gastrointestinal distress, including vomiting and diarrhea.\n4. Notes on",
      "concentration_notes": "◦ These compounds are concentrated in the milky sap (latex) found throughout the plant's leaves and stems.\n    ◦ While usually causing mild to moderate symptoms, the sap can be irritating enough to cause significant discomfort."
    }
  ],
  "symptoms": [
    {
      "name": "Oral Irritation (Pain and burning sensation in the mouth, tongue, and lips)",
      "body_system": "Gastrointestinal",
      "severity": "mild",
      "onset": "Immediate (Upon chewing or biting into the leaf/stem).",
      "notes": "The plant contains irritant sap (sometimes described as containing needle-like oxalate crystals) that causes immediate pain and inflammation when it contacts mucous membranes. This pain often deters the cat from consuming large amounts.Excessive Drooling (Hypersalivation)"
    },
    {
      "name": "Drooling / Hypersalivation",
      "body_system": "Gastrointestinal",
      "severity": "mild",
      "onset": "Immediate to Acute (Shortly after oral contact).",
      "notes": "This is a physiological response to the burning sensation and irritation in the mouth and throat caused by the plant's sap.Vomiting"
    },
    {
      "name": "Vomiting",
      "body_system": "Gastrointestinal",
      "severity": "mild",
      "onset": "Acute.",
      "notes": "Ingestion of the plant material or sap can irritate the stomach lining, triggering vomiting. The symptoms are usually self-limiting.Dermal Irritation (Contact Dermatitis)"
    },
    {
      "name": "Skin Irritation / Redness (Contact Dermatitis)",
      "body_system": "Dermal",
      "severity": "mild",
      "onset": "Acute (Upon contact with sap).",
      "notes": "The milky sap found in Ficus plants is a known irritant. If it gets on the cat's fur or skin, it can cause redness, itching, or blistering."
    }
  ],
  "treatments": [
    {
      "name": "Oral Irrigation / Decontamination",
      "description": "The immediate priority is to remove any remaining plant material from the cat's mouth. The veterinarian (or owner, under instruction) will gently wipe the mouth and rinse it thoroughly with cool water. This flushes out the needle-like calcium oxalate crystals and irritating sap that are causing pain and inflammation.",
      "notes": "This step is crucial because the primary mechanism of injury is physical trauma to the mucous membranes. Washing the skin is also necessary if sap has contacted the face or paws to prevent dermatitis or re-ingestion during grooming.Administration of Demulcents (Soothing Agents)",
      "priority": 1
    },
    {
      "name": "Administration of Calcium-Containing Dairy Products (Milk or Yogurt)",
      "description": "A veterinarian may administer or recommend offering a small amount of milk, yogurt, or a specific demulcent medication. These products help coat and soothe the irritated lining of the mouth and throat. Calcium in dairy can also help bind soluble oxalates (though Fiddle Leaf Fig primarily contains insoluble oxalates, the coating action effectively reduces pain from the crystals).",
      "notes": "This is a specific counter-measure for calcium oxalate plants. It aids in the clearance of crystals from the oral cavity and esophagus and provides immediate relief from the burning sensation.Symptomatic Supportive Care",
      "priority": 2
    },
    {
      "name": "Fluid Therapy and Anti-emetics",
      "description": "If the cat is vomiting persistently or refusing to drink due to oral pain, subcutaneous or intravenous fluids are administered to maintain hydration. Medications to stop vomiting (anti-emetics) and protect the stomach lining (gastroprotectants) may be given if gastrointestinal distress is significant.",
      "notes": "Most cases of Fiddle Leaf Fig ingestion are mild and self-limiting. Aggressive treatment is rarely needed unless the cat shows signs of airway swelling (laryngeal edema) causing breathing difficulties, which would require oxygen support and steroids, though this is uncommon.",
      "priority": 3
    }
  ]
}