{
  "plant": {
    "common_name": "Homalomena ‘Selby’",
    "scientific_name": "Homalomena 'Selby'",
    "family": "Araceae",
    "description": "Tropical foliage plant with heart-shaped, variegated leaves, often kept as a houseplant."
  },
  "basics": {},
  "toxic_parts": [
    "Entire Plant",
    "Leaf",
    "Stem",
    "Root"
  ],
  "toxins": [
    {
      "name": "Insoluble calcium oxalate crystals",
      "chemical_formula": null,
      "description": "in cats:\n    ◦ Physical Irritation: When the plant is chewed, it releases needle-like crystals that cause immediate and painful irritation to the sensitive tissues of the mouth, tongue, and throat. This results in symptoms such as intense burning, excessive drooling, and difficulty swallowing.\n4. Notes on",
      "concentration_notes": "◦ Severity: The toxicity is classified as Moderate.\n    ◦ Dose-Dependent Effects: While oral irritation is the primary sign, ingesting larger quantities can lead to more systemic issues such as diarrhea and lethargy.• Cat toxicity chart for 50 popular houseplants"
    }
  ],
  "symptoms": [
    {
      "name": "Mouth Irritation (Pain/Burning)",
      "body_system": "Gastrointestinal",
      "severity": "moderate",
      "onset": "Immediate (Upon chewing the plant material).",
      "notes": "The needle-like crystals embed in the soft tissues of the mouth and tongue, causing immediate discomfort.Excessive Drooling"
    },
    {
      "name": "Drooling (Hypersalivation)",
      "body_system": "Gastrointestinal",
      "severity": "moderate",
      "onset": "Immediate.",
      "notes": "This is a direct reaction to the pain and irritation caused by the crystals in the mouth.Vomiting"
    },
    {
      "name": "Vomiting",
      "body_system": "Gastrointestinal",
      "severity": "moderate",
      "onset": "Acute.",
      "notes": "Occurs as the body attempts to expel the irritating plant material.Reluctance to Eat (Anorexia)"
    },
    {
      "name": "Reluctance to Eat / Difficulty Swallowing",
      "body_system": "Gastrointestinal",
      "severity": "moderate",
      "onset": "Acute.",
      "notes": "The cat may refuse food due to the pain and swelling in the mouth and throat.Diarrhea"
    },
    {
      "name": "Diarrhea",
      "body_system": "Gastrointestinal",
      "severity": "moderate",
      "onset": "Delayed (Following ingestion of larger quantities).",
      "notes": "This symptom is noted specifically if the plant is \"ingested in quantity.\"Lethargy"
    },
    {
      "name": "Lethargy",
      "body_system": "Neurological",
      "severity": "moderate",
      "onset": "Acute/Delayed.",
      "notes": "Like diarrhea, this is more likely to occur if a significant amount of the plant has been consumed."
    }
  ],
  "treatments": [
    {
      "name": "Oral Rinsing / Irrigation",
      "description": "The veterinarian (or owner, under guidance) flushes the cat's mouth thoroughly with water. This helps to mechanically remove the needle-like oxalate crystals (raphides) and plant material that are embedding in the oral mucosa and causing pain.",
      "notes": "This is the primary and most immediate step to relieve the intense burning and irritation caused by the crystals. It effectively reduces the source of the pain.Administration of Demulcents (Calcium Binding)",
      "priority": 1
    },
    {
      "name": "Administration of Dairy Products (Milk or Yogurt)",
      "description": "The cat is fed or administered milk, yogurt, or another calcium-containing liquid. The calcium in these products binds to the insoluble oxalate crystals, helping to neutralize them and facilitate their clearance from the mouth and esophagus.",
      "notes": "This can soothe the irritated tissues and is often recommended alongside rinsing to provide relief from the \"pins and needles\" sensation.Symptomatic and Supportive Care",
      "priority": 2
    },
    {
      "name": "Fluid Therapy, Anti-emetics, and Analgesics",
      "description": "◦ Fluids: Intravenous (IV) or subcutaneous fluids are administered to correct dehydration if the cat has been vomiting or refusing to drink due to mouth pain.\n    ◦ Medications: Anti-emetics (to stop vomiting) and analgesics (pain relievers) may be given to manage gastrointestinal distress and oral discomfort.",
      "notes": "This is necessary if the cat is experiencing persistent vomiting, diarrhea, or is lethargic and unable to eat. Most animals recover within 24–48 hours with this supportive care.Airway Management (Rare)",
      "priority": 3
    },
    {
      "name": "Oxygen Support and Airway Security",
      "description": "In rare, severe cases where laryngeal edema (swelling of the throat) occurs, the veterinarian may need to provide supplemental oxygen or secure the airway (intubation) to ensure the cat can breathe.",
      "notes": "While swelling is a common symptom of insoluble oxalate ingestion, severe respiratory distress is less common but requires immediate emergency intervention if it occurs.",
      "priority": 4
    }
  ]
}