{
  "plant": {
    "common_name": "Heavenly Bamboo",
    "scientific_name": "Nandina spp.",
    "family": "Berberidaceae",
    "description": "Evergreen shrub with lace-like foliage and red berries, widely grown as an ornamental."
  },
  "basics": {
    "family": "Berberidaceae",
    "description": "Evergreen shrub with lace-like foliage and red berries, widely grown as an ornamental."
  },
  "toxic_parts": [
    "Leaf",
    "Fruit",
    "Seed"
  ],
  "toxins": [
    {
      "name": "Cyanogenic glycosides (which are converted into Cyanide upon ingestion)",
      "chemical_formula": null,
      "description": "in cats:\n    ◦ Activation: When the plant material (particularly seeds or leaves) is chewed or crushed, the cyanogenic glycosides interact with enzymes to release cyanide.\n    ◦ Cellular Disruption: The released cyanide binds with ferric (Fe\n3+\n) iron in the body.\n    ◦ Oxygen Blockage: This binding prevents the release of oxygen for cellular use, effectively halting cellular respiration.\n    ◦ Result: This process results in tissue hypoxia (oxygen deprivation) throughout the body2.\n4. Notes on",
      "concentration_notes": "◦ Location: The toxins are generally housed within the leaves and the seeds of the fruit2.\n    ◦ Bioavailability: If a seed is swallowed whole, the toxin is usually not released, and toxicity is not expected. The plant material must be compromised (chewed or ground) to become toxic2.\n    ◦ Potency: Severe toxicity in small animals is considered uncommon unless large ingestions occur. However, the onset of symptoms (such as respiratory distress and bright red mucous membranes) is rapid, often occurring within 10 to 60 minutes of exposure23.• Houseplants and Ornamentals Toxic to Animals - Toxicology - Merck Veterinary Manual2...\n• Clinical Perspectives on Feline Phytotoxicology"
    }
  ],
  "symptoms": [
    {
      "name": "Tachypnea (Rapid Breathing), Dyspnea (Difficulty Breathing), or Hyperventilation",
      "body_system": "Respiratory",
      "severity": "severe",
      "onset": "10–60 minutes after ingestion.",
      "notes": "Cyanide prevents the body's cells from utilizing oxygen (cellular hypoxia). The cat breathes rapidly in a desperate attempt to compensate for this lack of usable oxygen.\"Cherry Red\" Mucous Membranes"
    },
    {
      "name": "Bright Red Gums/Mucous Membranes",
      "body_system": "Hematological",
      "severity": "severe",
      "onset": "10–60 minutes.",
      "notes": "This is a classic hallmark of cyanide poisoning. Because the cells cannot absorb oxygen from the blood, the venous blood remains oxygenated and bright red (cherry red), causing the gums to appear unusually brick red rather than pale or blue (cyanotic), although cyanosis can occur in later stages.Neurological Abnormalities (Seizures/Coma)"
    },
    {
      "name": "Seizures, Tremors, Ataxia (Incoordination), or Coma",
      "body_system": "Neurological",
      "severity": "fatal",
      "onset": "10–60 minutes.",
      "notes": "The brain is highly sensitive to oxygen deprivation. As cellular hypoxia sets in, the cat may suffer convulsions or collapse into a coma.Gastrointestinal Upset"
    },
    {
      "name": "Vomiting and Diarrhea",
      "body_system": "Gastrointestinal",
      "severity": "moderate",
      "onset": "10–60 minutes.",
      "notes": "These are often the first signs observed. While less immediately fatal than the respiratory or cardiac effects, they indicate that the toxin has been ingested.Cardiovascular Collapse"
    },
    {
      "name": "Hypotension (Low Blood Pressure), Arrhythmias (Irregular Heartbeat), and Sudden Collapse",
      "body_system": "Cardiac",
      "severity": "fatal",
      "onset": "10–60 minutes.",
      "notes": "The toxin causes a drop in blood pressure and irregular heart rhythm, which often leads to sudden death before veterinary treatment can even be initiated.Almond Scented Breath"
    },
    {
      "name": "Bitter Almond\" Odor on Breath",
      "body_system": "Respiratory",
      "severity": "mild",
      "onset": "Acute.",
      "notes": "A distinct smell of bitter almonds may be detected on the cat's breath, which is a specific indicator of cyanide toxicity."
    }
  ],
  "treatments": [
    {
      "name": "Oxygen Supplementation and Administration of Cyanide Antidotes (e.g., Hydroxocobalamin or Sodium Nitrite with Sodium Thiosulfate)",
      "description": "◦ Oxygen: Supplemental oxygen is provided immediately to support tissue oxygenation, even though the toxin blocks oxygen utilization at the cellular level.\n    ◦ Antidotes: Veterinarians may administer specific antidotes to bind and neutralize the cyanide. Hydroxocobalamin combines with cyanide to form vitamin B12 (cyanocobalamin), which is safely excreted in urine. Alternatively, sodium nitrite (to form cyanomethemoglobin) followed by sodium thiosulfate (to form thiocyanate) may be used to draw cyanide away from cells and allow for excretion.",
      "notes": "Because signs of hypoxia (oxygen deprivation) develop so quickly, death can occur before treatment begins. If the cat is showing signs of respiratory distress or collapse, this step is critical and takes precedence over decontamination.Gastrointestinal Decontamination",
      "priority": 1
    },
    {
      "name": "Induction of Emesis (Vomiting) and Administration of Activated Charcoal",
      "description": "If the cat is asymptomatic and the ingestion was recent (typically within 1–2 hours), the veterinarian will induce vomiting to remove the plant material from the stomach. This is followed by activated charcoal (often with a cathartic) to bind any remaining toxins in the gastrointestinal tract.",
      "notes": "This should only be performed if the cat is neurologically stable. If the cat is already seizing, having trouble breathing, or is lethargic, inducing vomiting is dangerous due to the risk of aspiration pneumonia.Correction of Metabolic Acidosis",
      "priority": 2
    },
    {
      "name": "Administration of Sodium Bicarbonate",
      "description": "Cyanide toxicity often causes severe metabolic acidosis (an imbalance in the body's acid-base levels). The veterinarian will monitor the cat's blood gas values and administer sodium bicarbonate intravenously to correct the pH balance.",
      "notes": "This is a supportive measure used in severe cases to stabilize the patient's internal environment while the body clears the toxin.Fluid Therapy and Monitoring",
      "priority": 3
    },
    {
      "name": "Intravenous (IV) Fluid Therapy",
      "description": "IV fluids are administered to maintain blood pressure (hypotension is a common symptom) and to assist the kidneys in excreting the neutralized toxin (thiocyanate or cyanocobalamin).",
      "notes": "Most mild cases of cyanogenic plant exposure may only require this minimal gastrointestinal support. However, observation is essential to ensure the cat does not deteriorate.",
      "priority": 4
    }
  ]
}