{
  "plant": {
    "common_name": "Pine",
    "scientific_name": "Pinus spp.",
    "family": "Pinaceae",
    "description": "Brief Description (Appearance, Habitat, and Where Commonly Found)\n• Appearance: Pine trees are evergreens that produce tree sap and feature sharp needles and cones1.\n• Habitat and Where Commonly Found: The sources do not describe the natural habitat of pine trees in the wild. However, they note that pine trees are extremely common household items during the winter holidays, as they are frequently brought indoors to be used as Christmas trees"
  },
  "basics": {
    "family": "Pinaceae",
    "description": "Brief Description (Appearance, Habitat, and Where Commonly Found)\n• Appearance: Pine trees are evergreens that produce tree sap and feature sharp needles and cones1.\n• Habitat and Where Commonly Found: The sources do not describe the natural habitat of pine trees in the wild. However, they note that pine trees are extremely common household items during the winter holidays, as they are frequently brought indoors to be used as Christmas trees"
  },
  "toxic_parts": [
    "Sap",
    "Leaf"
  ],
  "toxins": [
    {
      "name": "Essential oils (specifically pine oil)",
      "chemical_formula": "Not provided in the given sources.",
      "description": "in cats: Cats are highly sensitive to essential oils because their livers lack the specific enzymes required to safely break down and metabolize these volatile compounds. When ingested, inhaled, or absorbed through the skin, pine essential oils can act as a direct irritant to the gastrointestinal tract, causing drooling and vomiting1. If absorbed systemically, the oils can cause severe organ damage, specifically liver damage, which can lead to seizures and even death",
      "concentration_notes": "The danger level is heavily dependent on the concentration of the oils. Live pine trees (such as those used for Christmas trees) contain very low concentrations of these essential oils and are typically not expected to result in major or life-threatening toxicity1. However, highly concentrated liquid forms, such as extracted pine essential oil, are extremely toxic and potentially fatal"
    },
    {
      "name": "Tree sap",
      "chemical_formula": "Not provided in the given sources.",
      "description": "in cats: Tree sap acts as a mild localized irritant. If a cat licks or ingests the sap from the tree, it irritates the mucous membranes and gastrointestinal tract, leading to self-limiting drooling and vomiting",
      "concentration_notes": "Toxicity from tree sap is generally considered mild1.\n(Note: While not a chemical compound, the sharp pine needles and cones also act as physical irritants that can cause gastrointestinal upset or dangerous blockages if swallowed1.)"
    }
  ],
  "symptoms": [
    {
      "name": "Drooling and vomiting",
      "body_system": "Gastrointestinal",
      "severity": "mild",
      "onset": "Not explicitly specified in the sources.",
      "notes": "This minor irritation is typically caused by the cat chewing on or ingesting the tree's sap, sharp needles, or cones1.\n2. Digestive Blockages"
    },
    {
      "name": "Digestive blockages",
      "body_system": "Gastrointestinal",
      "severity": "severe",
      "onset": "Not explicitly specified in the sources.",
      "notes": "Pine needles are very sharp and irritating; if swallowed, they pose a physical hazard that can potentially lead to dangerous blockages within the digestive tract2.\n3. Liver Damage"
    },
    {
      "name": "Liver damage",
      "body_system": "Hepatic",
      "severity": "fatal",
      "onset": "Not explicitly specified in the sources.",
      "notes": "This toxicity is caused by the essential oils found in pine trees3. Pine essential oil is explicitly listed as toxic to cats4. However, the sources note that the natural essential oils present within a live indoor Christmas tree are usually in low concentrations and are not generally expected to result in major toxicity compared to concentrated, extracted essential oils"
    }
  ],
  "treatments": [
    {
      "name": "Veterinary-Induced Vomiting",
      "description": "If a cat swallows a toxic substance (such as concentrated essential oils), a veterinarian may administer approved prescription medications in the clinic to safely induce vomiting and remove the toxin from the stomach",
      "notes": "You should never attempt to induce vomiting at home (such as by using hydrogen peroxide or salt). There are no safe over-the-counter emetics for cats, and attempting to do so can cause severe injury to the mouth, throat, and stomach, which will only complicate professional treatments1.\n2. Oral Rinsing and Dilution",
      "priority": 1
    },
    {
      "name": "Oral Rinsing and Dilution",
      "description": "The veterinarian may recommend rinsing the cat's mouth with lukewarm water or offering milk to help dilute and clear the irritating chemicals or oils from the oral cavity",
      "notes": "This is a common recommendation for swallowed chemicals or essential oils1. If the cat only chewed on the sap or needles of a live pine tree, the resulting drooling and vomiting are usually mild and self-limiting, and may not require major medical intervention2.\n3. Intervention for Digestive Blockages",
      "priority": 2
    },
    {
      "name": "Treatment for Digestive Blockages",
      "description": "Because pine needles are sharp, they act as physical irritants. If swallowed, they pose a serious physical hazard, and veterinary intervention (such as imaging or surgery) may be required to locate and clear an obstruction in the gastrointestinal tract",
      "notes": "This addresses the physical dangers of the plant rather than its chemical toxicity23.\n4. Systemic and Supportive Care for Liver Toxicity",
      "priority": 3
    },
    {
      "name": "Supportive Care for Liver Damage",
      "description": "The veterinary team will provide intensive care and monitoring to support the cat's organs if toxic oils have been absorbed into the bloodstream.",
      "notes": "The need for this treatment depends heavily on the form of pine the cat was exposed to. The natural essential oils present in a live indoor pine tree are typically in low concentrations and are not generally expected to cause major toxicity2. However, concentrated pine essential oils are explicitly toxic to cats and can cause severe, potentially fatal liver damage",
      "priority": 4
    }
  ]
}