{
  "plant": {
    "common_name": "Sweet Birch",
    "scientific_name": "Betula lenta",
    "family": "Betulaceae",
    "description": "Brief Description (Appearance, Habitat, and Where Commonly Found)\n• Appearance: Sweet Birch is a medium-to-large deciduous tree that typically grows 50 to 80 feet tall. Unlike the peeling, papery white bark associated with many other birch trees, the Sweet Birch has dark, shiny, reddish-brown to almost black bark that closely resembles the bark of a cherry tree. Its leaves are simple, alternate, and ovate with serrated edges. Its most distinguishing feature is its scent; the twigs and inner bark emit a very strong wintergreen aroma when scraped or crushed (which is why it is historically used to extract wintergreen oil).\n• Habitat and Where Commonly Found: Native to eastern North America, it thrives in cool, moist, and well-drained soils. It is most commonly found growing in the rich, deep forest soils of the Appalachian Mountains, ranging from southern Maine down to northern Georgia."
  },
  "basics": {
    "family": "Betulaceae",
    "description": "Brief Description (Appearance, Habitat, and Where Commonly Found)\n• Appearance: Sweet Birch is a medium-to-large deciduous tree that typically grows 50 to 80 feet tall. Unlike the peeling, papery white bark associated with many other birch trees, the Sweet Birch has dark, shiny, reddish-brown to almost black bark that closely resembles the bark of a cherry tree. Its leaves are simple, alternate, and ovate with serrated edges. Its most distinguishing feature is its scent; the twigs and inner bark emit a very strong wintergreen aroma when scraped or crushed (which is why it is historically used to extract wintergreen oil).\n• Habitat and Where Commonly Found: Native to eastern North America, it thrives in cool, moist, and well-drained soils. It is most commonly found growing in the rich, deep forest soils of the Appalachian Mountains, ranging from southern Maine down to northern Georgia."
  },
  "toxic_parts": [
    "Bark",
    "Leaf",
    "Root"
  ],
  "toxins": [
    {
      "name": "The provided sources specifically identify Sweet birch essential oil as the toxic substance",
      "chemical_formula": null,
      "description": "in cats: Cats lack specific liver enzymes required to safely break down and process the volatile compounds found in essential oils2. Whether the oil is absorbed directly through the skin, inhaled into the respiratory tract, or ingested from grooming, the compounds enter the bloodstream and travel to the cat's liver34. Because the cat cannot efficiently metabolize these substances, the toxins build up in the body and cause serious organ damage, which can rapidly progress to liver failure, seizures, and death",
      "concentration_notes": "Essential oils are highly potent, concentrated plant extracts. The sources warn that these oils are especially harmful to cats when used \"neat\" (undiluted)5. However, because cats are so sensitive to these compounds, even indirect exposure—such as inhaling aerosolized droplets from a reed diffuser, plug-in, or nebulizer—can be hazardous"
    }
  ],
  "symptoms": [
    {
      "name": "Sore skin, redness, or chemical burns",
      "body_system": "Dermal",
      "severity": "severe",
      "onset": "Not explicitly specified in the sources.",
      "notes": "This occurs from direct physical contact with the essential oil. The sources warn that even if there is no visible damage to the skin, you should not assume the cat is safe, as the oil can still be absorbed or ingested during grooming23.\n2. Excessive Dribbling (Drooling)"
    },
    {
      "name": "Excessive dribbling",
      "body_system": "Gastrointestinal",
      "severity": "moderate",
      "onset": "Not explicitly specified.",
      "notes": "This is often an immediate reaction to tasting or swallowing the bitter, irritating oil, which can happen if a cat licks the oil off its fur or drinks from a reed diffuser23.\n3. Vomiting"
    },
    {
      "name": "Vomiting",
      "body_system": "Gastrointestinal",
      "severity": "severe",
      "onset": "Not explicitly specified.",
      "notes": "Vomiting is a common sign of systemic toxicity or gastrointestinal irritation after the cat swallows the oil23.\n4. Difficulty Breathing"
    },
    {
      "name": "Difficulty breathing or open-mouth breathing",
      "body_system": "Respiratory",
      "severity": "severe",
      "onset": "Not explicitly specified.",
      "notes": "While toxic effects from simply inhaling diluted oils are rare, the risk of respiratory distress increases significantly if the cat inhales nebulized or ultrasonically diffused neat (undiluted) essential oils, or if the cat has a pre-existing medical condition like asthma23.\n5. Lethargy and Depression"
    },
    {
      "name": "Lethargy, depression, or dullness",
      "body_system": "Gastrointestinal",
      "severity": "severe",
      "onset": "Not explicitly specified.",
      "notes": "This indicates a severe systemic reaction to the toxins in the bloodstream3.\n6. Neurological Impairment (Ataxia, Tremors, and Seizures)"
    },
    {
      "name": "Shaking, tremoring, \"walking as if they're drunk\" (ataxia), collapse, and seizures",
      "body_system": "Neurological",
      "severity": "fatal",
      "onset": "Not explicitly specified.",
      "notes": "Essential oils can severely impact the central nervous system. If the toxicity progresses to collapse or seizures, it is an extreme, life-threatening emergency3.\n7. Liver Failure"
    },
    {
      "name": "Liver failure (and serious organ damage)",
      "body_system": "Hepatic",
      "severity": "fatal",
      "onset": "Not explicitly specified.",
      "notes": "Because cats lack the specific liver enzymes to process these compounds, the toxins build up and cause severe internal damage. In extreme cases, this leads to complete liver failure and death"
    }
  ],
  "treatments": [
    {
      "name": "Oral Rinsing and Dilution",
      "description": "The mouth is rinsed with lukewarm water, or the cat is offered milk to help dilute the ingested oils",
      "notes": "Do NOT induce vomiting. Because essential oils can cause chemical burns, inducing vomiting is heavily contraindicated; bringing the oil back up can severely burn and damage the cat's digestive tract45.\n2. Dermal Decontamination (If Ingested from Grooming)",
      "priority": 1
    },
    {
      "name": "Bathing (Topical Decontamination)",
      "description": "If the ingestion occurred because the cat was licking the essential oil off its coat, the cat must be bathed using a liquid dish soap and lukewarm water to remove any remaining residue",
      "notes": "Solvents should never be used to strip the fur. If the cat is aggressive or in too much distress to be bathed, the veterinarian can provide mild sedation to handle them safely6.\n3. Systemic Organ Support",
      "priority": 2
    },
    {
      "name": "Intravenous (IV) Fluid Therapy",
      "description": "The veterinary team will administer IV fluids to rehydrate the cat, help flush the toxins out of the bloodstream, and support vital organ function",
      "notes": "This is a critical step because essential oils are primarily processed in the liver, and IV fluids help protect both the liver and kidneys from failing as the toxins are eliminated35.\n4. Gastrointestinal and Hepatic Medication",
      "priority": 3
    },
    {
      "name": "Pharmacological Support (Protectants and Anti-emetics)",
      "description": "The veterinarian will administer a combination of anti-emetic (anti-vomiting) medications, drugs designed to coat and protect the stomach lining, and specific liver-protectant medications",
      "notes": "If the essential oil has caused internal chemical burns, the veterinarian will also prescribe appropriate pain medications and antibiotics to prevent infection5.\n5. Nutritional Support",
      "priority": 4
    },
    {
      "name": "Feeding Tube Insertion",
      "description": "A feeding tube is surgically inserted directly into the cat's stomach to bypass the mouth and throat, allowing the cat to receive necessary nutrition.",
      "notes": "This is only utilized in severe cases where the essential oil has caused significant chemical burns to the cat's mouth or digestive tract, rendering them unable to eat normally while their injuries heal",
      "priority": 5
    }
  ]
}