{
  "plant": {
    "common_name": "Yellow Oleander",
    "scientific_name": "Thevetia peruviana",
    "family": "Apocynaceae",
    "description": "The sources do not contain information about the plant's botanical family, detailed physical appearance, or habitat.\n(Please note that the following information is not from your sources and you may want to independently verify it):\n1. Botanical Family The Yellow Oleander belongs to the dogbane family, Apocynaceae (the same family as the common pink/white oleander, Nerium oleander).\n2. Brief Description (Appearance, Habitat, and Where Commonly Found)\n• Appearance: Yellow Oleander is a fast-growing, evergreen shrub or small tree that can reach up to 10 to 20 feet in height. It features spirally arranged, narrow, willow-like, glossy green leaves. It is heavily prized for its fragrant, funnel- or trumpet-shaped flowers that are typically bright yellow (but can also be pale orange or peach). After flowering, it produces distinctively shaped, fleshy, somewhat triangular or globular seed pods that start green and turn black as they ripen.\n• Habitat and Where Commonly Found: Native to tropical regions of the Americas (ranging from Mexico into Central and South America), it thrives in full sun and well-draining soils. Because it is highly drought-tolerant and features striking flowers, it is widely cultivated globally and is very commonly found planted as an ornamental shrub, hedge, or street tree in warm, tropical, and subtropical climates."
  },
  "basics": {
    "family": "Apocynaceae",
    "description": "The sources do not contain information about the plant's botanical family, detailed physical appearance, or habitat.\n(Please note that the following information is not from your sources and you may want to independently verify it):\n1. Botanical Family The Yellow Oleander belongs to the dogbane family, Apocynaceae (the same family as the common pink/white oleander, Nerium oleander).\n2. Brief Description (Appearance, Habitat, and Where Commonly Found)\n• Appearance: Yellow Oleander is a fast-growing, evergreen shrub or small tree that can reach up to 10 to 20 feet in height. It features spirally arranged, narrow, willow-like, glossy green leaves. It is heavily prized for its fragrant, funnel- or trumpet-shaped flowers that are typically bright yellow (but can also be pale orange or peach). After flowering, it produces distinctively shaped, fleshy, somewhat triangular or globular seed pods that start green and turn black as they ripen.\n• Habitat and Where Commonly Found: Native to tropical regions of the Americas (ranging from Mexico into Central and South America), it thrives in full sun and well-draining soils. Because it is highly drought-tolerant and features striking flowers, it is widely cultivated globally and is very commonly found planted as an ornamental shrub, hedge, or street tree in warm, tropical, and subtropical climates."
  },
  "toxic_parts": [
    "Stem",
    "Bark",
    "Seed",
    "Entire Plant",
    "Leaf",
    "Flower",
    "Fruit",
    "Root",
    "Sap"
  ],
  "toxins": [
    {
      "name": "Cardiac glycosides (specifically noted in related oleander species as cardenolides, such as oleandrin)",
      "chemical_formula": "Not provided in the sources.",
      "description": "in cats: Cardiac glycosides directly interfere with the electrical signaling and muscle contractions of the cat's heart13. They do this by inhibiting the Na\n+\n/K\n+\n-ATPase pump, which is a necessary component for normal cardiac function35. This inhibition causes an accumulation of intracellular sodium (Na\n+\n) and extracellular potassium (K\n+\n), which subsequently leads to a dangerous rise in intracellular calcium (Ca\n++\n)35. The result is that the heart's contractions become more forceful but abnormally slow (bradycardia), eventually leading to life-threatening heart rhythm abnormalities (arrhythmias) and potential cardiovascular collapse",
      "concentration_notes": "Cardiac glycosides are extremely potent and have a very narrow margin of safety6. Because the toxins are so powerful, there is no safe level of ingestion; even a very small amount of the plant—or simply drinking the water from a plant base or vase—can be fatal to cats23. While the toxins are present in all parts of the plant, they are highly concentrated and can cause a rapid onset of severe gastrointestinal, neurological, and cardiovascular symptoms"
    }
  ],
  "symptoms": [
    {
      "name": "Vomiting, diarrhea, excessive drooling, and abdominal pain",
      "body_system": "Gastrointestinal",
      "severity": "severe",
      "onset": "Within the first 2 hours after exposure",
      "notes": "Gastrointestinal distress usually acts as the initial sign of poisoning from the plant's cardiac glycosides, often appearing just prior to major heart function abnormalities34. Symptoms can persist for up to 4 to 5 days3.\n2. Abnormal Heart Rate and Arrhythmias"
    },
    {
      "name": "Bradycardia (abnormally slow heart rate) or tachycardia (rapid heart rate), and severe arrhythmias",
      "body_system": "Cardiac",
      "severity": "fatal",
      "onset": "Expected within the first 2 hours after exposure",
      "notes": "Cardiac glycosides directly interfere with the heart by inhibiting the Na\n+\n/K\n+\n-ATPase pump, altering intracellular calcium and sodium levels [645, Conversation History]. This causes the heart's contractions to become forceful but irregular, which can rapidly lead to life-threatening cardiovascular collapse [645, Conversation History].\n3. Hyperkalemia (High Potassium)"
    },
    {
      "name": "Hyperkalemia (elevated potassium levels in the blood)",
      "body_system": "Hematological",
      "severity": "fatal",
      "onset": "Within the first 2 hours after exposure",
      "notes": "This dangerous accumulation of extracellular potassium is a direct result of the disrupted cellular pumps35. Severe hyperkalemia (> 7.5–9mEq/L) requires aggressive, emergency intravenous intervention (such as sodium bicarbonate or dextrose/insulin therapy) to stabilize the cat3.\n4. Weakness and Lethargy"
    },
    {
      "name": "Weakness and lethargy",
      "body_system": "Neurological",
      "severity": "severe",
      "onset": "Within the first 2 hours after exposure",
      "notes": "The profound weakness is a systemic reflection of the severe cardiovascular disruption and plummeting blood pressure34.\n5. Tremors and Seizures"
    },
    {
      "name": "Tremors and seizures",
      "body_system": "Gastrointestinal",
      "severity": "severe",
      "onset": "Often within the first few hours, progressing as the toxicosis worsens",
      "notes": "These severe neurological manifestations occur in advanced stages of cardiac glycoside poisoning from oleander species26.\n6. Difficulty Breathing"
    },
    {
      "name": "Respiratory changes and difficulty breathing",
      "body_system": "Respiratory",
      "severity": "severe",
      "onset": "Usually presents as the toxicity progresses (within hours)",
      "notes": "Respiratory distress typically accompanies the severe, systemic decline in cardiovascular output and neurological stability"
    }
  ],
  "treatments": [
    {
      "name": "Emesis Induction and Activated Charcoal",
      "description": "If the cat is asymptomatic and ingested the plant recently, the veterinarian will induce vomiting to clear the stomach, followed by administering a dose of activated charcoal with a cathartic to bind unabsorbed toxins",
      "notes": "Because the toxins undergo enterohepatic recirculation (recirculating between the liver and intestines), the vet will likely repeat the activated charcoal (without a cathartic) every 6 to 8 hours for a total of 3 doses to ensure the toxins are fully neutralized1.\n2. Antidote Administration",
      "priority": 1
    },
    {
      "name": "Digoxin-Specific Antibody Fragments (Fab)",
      "description": "The veterinary team administers a specific antidote originally designed for digoxin medication toxicity, which works effectively to neutralize the plant's cardiac glycosides",
      "notes": "Patients who have access to this specific antidote generally have a guarded to good prognosis, while those without access have a guarded to poor prognosis1.\n3. Intravenous Fluid Therapy and Electrolyte Management",
      "priority": 2
    },
    {
      "name": "IV Fluid Therapy and Hyperkalemia Treatment",
      "description": "The cat is given intravenous fluids to provide hemodynamic (blood flow) support while electrolytes are closely monitored",
      "notes": "Yellow Oleander poisoning can cause a life-threatening spike in potassium. While mild hyperkalemia can be managed with IV fluids alone, severe hyperkalemia (> 7.5–9mEq/L) requires urgent, targeted treatment using sodium bicarbonate or a dextrose/insulin therapy1.\n4. Antiarrhythmic and Cardiovascular Medications",
      "priority": 3
    },
    {
      "name": "Pharmacological Cardiac Support (e.g., Lidocaine, Atropine, Glycopyrrolate)",
      "description": "The veterinarian administers specific heart medications to control the life-threatening heart rhythm abnormalities caused by the toxins",
      "notes": "Antiarrhythmics like lidocaine are heavily relied upon if the digoxin-specific antidote is not available1. Additionally, if the cat is suffering from severe bradycardia (an abnormally slow heart rate), medications such as atropine or glycopyrrolate are successfully used to stabilize the heart rate",
      "priority": 4
    }
  ]
}