{
  "plant": {
    "common_name": "Grapes / Raisins / Currants",
    "scientific_name": "Vitis vinifera",
    "family": "Vitaceae",
    "description": "Deciduous woody vines known for their fruit (grapes), which can be eaten fresh or dried."
  },
  "basics": {},
  "toxic_parts": [
    "Stem",
    "Root",
    "Leaf",
    "Fruit"
  ],
  "toxins": [
    {
      "name": "Tartaric Acid and its salt, Potassium Bitartrate (Cream of Tartar)",
      "chemical_formula": null,
      "description": "in cats:\n    ◦ Nephrotoxicity (Kidney Damage): These compounds are considered the primary toxic principles responsible for causing acute kidney failure in cats and dogs.\n    ◦ Rapid Onset: The toxins are rapidly absorbed, often leading to vomiting within 12 hours, followed by diarrhea, lethargy, and increased thirst as kidney function declines.\n    ◦ Target Organ: The active substances specifically target the kidneys, leading to acute renal failure which can be fatal if not treated immediately.",
      "concentration_notes": "◦ High Potency: Ingestion of even a small amount of the fruit (fresh or dried) can be sufficient to cause kidney failure.\n    ◦ Variable Sensitivity: There is individual variation; some cats may ingest these fruits without apparent ill effects, while others develop severe acute kidney failure.\n    ◦ Concentrated Sources: Dried forms like raisins and currants (Zante currants) are particularly dangerous. Additionally, Cream of Tartar and Tamarinds (which also contain high levels of tartaric acid) are now implicated as toxic hazards.• Clinical Perspectives on Feline Phytotoxicology1\n• What Can't Cats Eat? 8 Toxic Foods for Cats2\n• 10 Foods that are Dangerous for Cats3\n• Dangerous Foods for Cats"
    }
  ],
  "symptoms": [
    {
      "name": "Vomiting",
      "body_system": "Gastrointestinal",
      "severity": "severe",
      "onset": "Within 12 hours of ingestion.",
      "notes": "This is typically the first clinical sign of toxicity. The vomit may contain pieces of the undigested fruit.Diarrhea"
    },
    {
      "name": "Diarrhea",
      "body_system": "Gastrointestinal",
      "severity": "moderate",
      "onset": "12–24 hours (Often follows the initial vomiting).",
      "notes": "Occurs as the toxins move through the digestive tract; may contribute to dehydration which exacerbates kidney stress.Lethargy and Weakness"
    },
    {
      "name": "Lethargy, Weakness, or Depression",
      "body_system": "Neurological",
      "severity": "severe",
      "onset": "12–24 hours.",
      "notes": "The cat may appear unusually tired, hide, or refuse to move as kidney function begins to decline and uremic toxins build up in the blood.Polydipsia and Polyuria"
    },
    {
      "name": "Increased Thirst (Polydipsia) and Increased Urination (Polyuria)",
      "body_system": "Renal",
      "severity": "severe",
      "onset": "Initial 24 hours.",
      "notes": "Early in the poisoning process, the kidneys may lose the ability to concentrate urine, leading to excessive drinking and urination before shutting down.Acute Kidney Failure (Anuria)"
    },
    {
      "name": "Oliguria (Decreased Urine) or Anuria (No Urine Production)",
      "body_system": "Renal",
      "severity": "fatal",
      "onset": "12–72 hours (As the condition worsens).",
      "notes": "This indicates that the kidneys have stopped functioning (shut down). Without immediate emergency intervention, this stage is often fatal. Some cats may be unaffected by grapes, while others develop this condition rapidly; the exact reason for individual sensitivity varies.Anorexia"
    },
    {
      "name": "Poor Appetite or Refusal to Eat",
      "body_system": "Gastrointestinal",
      "severity": "severe",
      "onset": "12–24 hours.",
      "notes": "Cats often refuse food as nausea sets in from the elevated kidney toxins in their blood."
    }
  ],
  "treatments": [
    {
      "name": "Induction of Emesis (Vomiting) and Administration of Activated Charcoal",
      "description": "If the ingestion was recent, the veterinarian will administer prescription medication to induce vomiting, removing the fruit from the stomach before the toxins are fully absorbed45. This is typically followed by the administration of activated charcoal (often with a cathartic) to bind any remaining toxins in the gastrointestinal tract and prevent them from entering the bloodstream",
      "notes": "Owners should not attempt to induce vomiting at home using salt or hydrogen peroxide, as this is unsafe for cats and can cause severe injury or poisoning4. This procedure is most effective when performed within hours of ingestion78.\n2. Aggressive Fluid Therapy",
      "priority": 1
    },
    {
      "name": "Intravenous (IV) Fluid Diuresis",
      "description": "The veterinarian will administer IV fluids to correct dehydration and, crucially, to support the kidneys. Fluid therapy helps to \"flush\" the kidneys (diuresis), maintaining urine production and helping to clear toxins from the body",
      "notes": "Because grapes and raisins target the kidneys, fluid therapy is essential to prevent the onset of anuria (the cessation of urine production), which is a fatal complication of acute renal failure1011. Treatment may need to continue for 48 to 72 hours to ensure the kidneys are protected10.\n3. Baseline Blood Work and Monitoring",
      "priority": 2
    },
    {
      "name": "Renal Function Monitoring (Biochemistry Profile)",
      "description": "The veterinary team will run blood tests to establish baseline levels for kidney function, specifically checking creatinine, BUN (blood urea nitrogen), and electrolyte levels5. These tests are repeated (often every 24 hours) to track the progression of the toxicity or the success of the treatment",
      "notes": "Clinical signs of kidney failure from grapes may not appear immediately; vomiting often starts within 12 hours, but severe renal failure markers may take 24 hours to days to manifest512. Therefore, monitoring is critical even if the cat appears fine initially",
      "priority": 3
    }
  ]
}